{
    "name": "primelyrics",
    "plugins": [
        {
            "name": "TailwindCSS",
            "description": "A utility-first CSS framework packed with classes like flex, pt-4, text-center and rotate-90 that can be composed to build any design, directly in your markup.",
            "url": "https://tailwindcss.com/docs"
        },
        {
            "name": "CSS / styled-jsx",
            "description": "Next.js comes with built-in support for CSS and styled-jsx. Styled-jsx is full, scoped and component-friendly CSS support for JSX (rendered on the server or the client).",
            "url": "https://github.com/vercel/styled-jsx"
        },
        {
            "name": "Axios",
            "description": "Promise based HTTP client for the browser and node.js.",
            "url": "https://github.com/axios/axios"
        },
        {
            "name": "Bundle Analyzer",
            "description": "Use webpack-bundle-analyzer in your Next.js project. Visualize size of webpack output files with an interactive zoomable treemap.",
            "url": "https://github.com/vercel/next.js/tree/canary/packages/next-bundle-analyzer"
        },
        {
            "name": "React Query",
            "description": "Hooks for fetching, caching and updating asynchronous data in React.",
            "url": "https://react-query.tanstack.com/overview"
        },
        {
            "name": "Recoil",
            "description": "Recoil works and thinks like React. Add some to your app and get fast and flexible shared state.",
            "url": "https://recoiljs.org/docs/introduction/installation"
        },
        {
            "name": "ESLint",
            "description": "A pluggable and configurable linter tool for identifying and reporting on patterns in JavaScript. Maintain your code quality with ease.",
            "url": "https://eslint.org/docs/user-guide/getting-started"
        },
        {
            "name": "Prettier",
            "description": "An opinionated code formatter; Supports many languages; Integrates with most editors.",
            "url": "https://prettier.io/docs/en/index.html"
        },
        {
            "name": "lint-staged",
            "description": " The concept of lint-staged is to run configured linter (or other) tasks on files that are staged in git.",
            "url": "https://github.com/okonet/lint-staged"
        },
        {
            "name": "Testing Library",
            "description": "The React Testing Library is a very light-weight solution for testing React components. It provides light utility functions on top of react-dom and react-dom/test-utils.",
            "url": "https://testing-library.com/docs/"
        },
        {
            "name": "Docker",
            "description": "",
            "url": ""
        },
        {
            "name": "Github Actions",
            "description": "GitHub Actions makes it easy to automate all your software workflows, now with world-class CI/CD. Build, test, and deploy your code right from GitHub.",
            "url": "https://docs.github.com/en/actions"
        }
    ]
}
